#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.rnl.module.api.azurerm_api_management.api will be created
  + resource "azurerm_api_management" "api" {
      + client_certificate_enabled    = false
      + developer_portal_url          = (known after apply)
      + gateway_disabled              = false
      + gateway_regional_url          = (known after apply)
      + gateway_url                   = (known after apply)
      + id                            = (known after apply)
      + location                      = "eastus"
      + management_api_url            = (known after apply)
      + name                          = "rnl-dev"
      + notification_sender_email     = (known after apply)
      + policy                        = (known after apply)
      + portal_url                    = (known after apply)
      + private_ip_addresses          = (known after apply)
      + public_ip_addresses           = (known after apply)
      + public_network_access_enabled = true
      + publisher_email               = "cameron.jeffries@terazo.com"
      + publisher_name                = "Cameron Jeffries"
      + resource_group_name           = "rnl-dev"
      + scm_url                       = (known after apply)
      + sku_name                      = "Developer_1"
      + virtual_network_type          = "None"

      + hostname_configuration {
          + developer_portal {
              + certificate                     = (sensitive value)
              + certificate_password            = (sensitive value)
              + expiry                          = (known after apply)
              + host_name                       = (known after apply)
              + key_vault_id                    = (known after apply)
              + negotiate_client_certificate    = (known after apply)
              + ssl_keyvault_identity_client_id = (known after apply)
              + subject                         = (known after apply)
              + thumbprint                      = (known after apply)
            }

          + management {
              + certificate                     = (sensitive value)
              + certificate_password            = (sensitive value)
              + expiry                          = (known after apply)
              + host_name                       = (known after apply)
              + key_vault_id                    = (known after apply)
              + negotiate_client_certificate    = (known after apply)
              + ssl_keyvault_identity_client_id = (known after apply)
              + subject                         = (known after apply)
              + thumbprint                      = (known after apply)
            }

          + portal {
              + certificate                     = (sensitive value)
              + certificate_password            = (sensitive value)
              + expiry                          = (known after apply)
              + host_name                       = (known after apply)
              + key_vault_id                    = (known after apply)
              + negotiate_client_certificate    = (known after apply)
              + ssl_keyvault_identity_client_id = (known after apply)
              + subject                         = (known after apply)
              + thumbprint                      = (known after apply)
            }

          + proxy {
              + certificate                     = (sensitive value)
              + certificate_password            = (sensitive value)
              + default_ssl_binding             = (known after apply)
              + expiry                          = (known after apply)
              + host_name                       = (known after apply)
              + key_vault_id                    = (known after apply)
              + negotiate_client_certificate    = (known after apply)
              + ssl_keyvault_identity_client_id = (known after apply)
              + subject                         = (known after apply)
              + thumbprint                      = (known after apply)
            }

          + scm {
              + certificate                     = (sensitive value)
              + certificate_password            = (sensitive value)
              + expiry                          = (known after apply)
              + host_name                       = (known after apply)
              + key_vault_id                    = (known after apply)
              + negotiate_client_certificate    = (known after apply)
              + ssl_keyvault_identity_client_id = (known after apply)
              + subject                         = (known after apply)
              + thumbprint                      = (known after apply)
            }
        }

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }

      + protocols {
          + enable_http2 = (known after apply)
        }

      + security {
          + enable_backend_ssl30                                = (known after apply)
          + enable_backend_tls10                                = (known after apply)
          + enable_backend_tls11                                = (known after apply)
          + enable_frontend_ssl30                               = (known after apply)
          + enable_frontend_tls10                               = (known after apply)
          + enable_frontend_tls11                               = (known after apply)
          + enable_triple_des_ciphers                           = (known after apply)
          + tls_ecdhe_ecdsa_with_aes128_cbc_sha_ciphers_enabled = (known after apply)
          + tls_ecdhe_ecdsa_with_aes256_cbc_sha_ciphers_enabled = (known after apply)
          + tls_ecdhe_rsa_with_aes128_cbc_sha_ciphers_enabled   = (known after apply)
          + tls_ecdhe_rsa_with_aes256_cbc_sha_ciphers_enabled   = (known after apply)
          + tls_rsa_with_aes128_cbc_sha256_ciphers_enabled      = (known after apply)
          + tls_rsa_with_aes128_cbc_sha_ciphers_enabled         = (known after apply)
          + tls_rsa_with_aes128_gcm_sha256_ciphers_enabled      = (known after apply)
          + tls_rsa_with_aes256_cbc_sha256_ciphers_enabled      = (known after apply)
          + tls_rsa_with_aes256_cbc_sha_ciphers_enabled         = (known after apply)
          + triple_des_ciphers_enabled                          = (known after apply)
        }

      + sign_in {
          + enabled = (known after apply)
        }

      + sign_up {
          + enabled = (known after apply)

          + terms_of_service {
              + consent_required = (known after apply)
              + enabled          = (known after apply)
              + text             = (known after apply)
            }
        }

      + tenant_access {
          + enabled       = (known after apply)
          + primary_key   = (sensitive value)
          + secondary_key = (sensitive value)
          + tenant_id     = (known after apply)
        }
    }

  # module.rnl.module.twilio.twilio_chat_services_v2.chat_service will be created
  + resource "twilio_chat_services_v2" "chat_service" {
      + consumption_report_interval                   = (known after apply)
      + default_channel_creator_role_sid              = (known after apply)
      + default_channel_role_sid                      = (known after apply)
      + default_service_role_sid                      = (known after apply)
      + friendly_name                                 = "Flex Chat Service"
      + id                                            = (known after apply)
      + limits_channel_members                        = (known after apply)
      + limits_user_channels                          = (known after apply)
      + media_compatibility_message                   = (known after apply)
      + notifications_added_to_channel_enabled        = (known after apply)
      + notifications_added_to_channel_sound          = (known after apply)
      + notifications_added_to_channel_template       = (known after apply)
      + notifications_invited_to_channel_enabled      = (known after apply)
      + notifications_invited_to_channel_sound        = (known after apply)
      + notifications_invited_to_channel_template     = (known after apply)
      + notifications_log_enabled                     = (known after apply)
      + notifications_new_message_badge_count_enabled = (known after apply)
      + notifications_new_message_enabled             = (known after apply)
      + notifications_new_message_sound               = (known after apply)
      + notifications_new_message_template            = (known after apply)
      + notifications_removed_from_channel_enabled    = (known after apply)
      + notifications_removed_from_channel_sound      = (known after apply)
      + notifications_removed_from_channel_template   = (known after apply)
      + post_webhook_retry_count                      = (known after apply)
      + post_webhook_url                              = (known after apply)
      + pre_webhook_retry_count                       = (known after apply)
      + pre_webhook_url                               = (known after apply)
      + reachability_enabled                          = true
      + read_status_enabled                           = true
      + sid                                           = (known after apply)
      + typing_indicator_timeout                      = (known after apply)
      + webhook_filters                               = [
          + "onMessageSent",
          + "onChannelDestroyed",
          + "onChannelUpdated",
        ]
      + webhook_method                                = (known after apply)
    }

  # module.rnl.module.twilio.twilio_studio_flows_v2.flow will be created
  + resource "twilio_studio_flows_v2" "flow" {
      + commit_message = "first draft"
      + definition     = jsonencode(
            {
              + description   = "A New Flow"
              + flags         = {
                  + allow_concurrent_calls = true
                }
              + initial_state = "Trigger"
              + states        = [
                  + {
                      + name        = "Trigger"
                      + properties  = {
                          + offset = {
                              + x = 0
                              + y = 0
                            }
                        }
                      + transitions = []
                      + type        = "trigger"
                    },
                ]
            }
        )
      + friendly_name  = "terraform flow 1"
      + id             = (known after apply)
      + sid            = (known after apply)
      + status         = "draft"
    }

  # module.rnl.module.sso_service.module.sso_service.azuread_application.ad_application_function_app will be created
  + resource "azuread_application" "ad_application_function_app" {
      + app_role_ids                = (known after apply)
      + application_id              = (known after apply)
      + disabled_by_microsoft       = (known after apply)
      + display_name                = "rnl-sso-dev-ad-application-function-app"
      + id                          = (known after apply)
      + logo_url                    = (known after apply)
      + oauth2_permission_scope_ids = (known after apply)
      + object_id                   = (known after apply)
      + prevent_duplicate_names     = true
      + publisher_domain            = (known after apply)
      + sign_in_audience            = "AzureADMyOrg"
      + tags                        = (known after apply)
      + template_id                 = (known after apply)

      + feature_tags {
          + custom_single_sign_on = (known after apply)
          + enterprise            = (known after apply)
          + gallery               = (known after apply)
          + hide                  = (known after apply)
        }
    }

  # module.rnl.module.sso_service.module.sso_service.azurerm_api_management_api.api_management_api_public will be created
  + resource "azurerm_api_management_api" "api_management_api_public" {
      + api_management_name   = "rnl-dev"
      + display_name          = "Public"
      + id                    = (known after apply)
      + is_current            = (known after apply)
      + is_online             = (known after apply)
      + name                  = "rnl-sso-dev-api-management-api-public"
      + path                  = (known after apply)
      + protocols             = [
          + "https",
        ]
      + resource_group_name   = "rnl-dev"
      + revision              = "1"
      + service_url           = (known after apply)
      + soap_pass_through     = false
      + subscription_required = false
      + version               = (known after apply)
      + version_set_id        = (known after apply)

      + subscription_key_parameter_names {
          + header = (known after apply)
          + query  = (known after apply)
        }
    }

  # module.rnl.module.sso_service.module.sso_service.azurerm_api_management_api_operation.api_management_api_operation_public_hello_world will be created
  + resource "azurerm_api_management_api_operation" "api_management_api_operation_public_hello_world" {
      + api_management_name = "rnl-dev"
      + api_name            = "rnl-sso-dev-api-management-api-public"
      + display_name        = "Hello World API endpoint"
      + id                  = (known after apply)
      + method              = "GET"
      + operation_id        = "public-hello-world"
      + resource_group_name = "rnl-dev"
      + url_template        = "/hello-world"

      + request {
          + description = (known after apply)

          + header {
              + default_value = (known after apply)
              + description   = (known after apply)
              + name          = (known after apply)
              + required      = (known after apply)
              + type          = (known after apply)
              + values        = (known after apply)
            }

          + query_parameter {
              + default_value = (known after apply)
              + description   = (known after apply)
              + name          = (known after apply)
              + required      = (known after apply)
              + type          = (known after apply)
              + values        = (known after apply)
            }

          + representation {
              + content_type = (known after apply)
              + sample       = (known after apply)
              + schema_id    = (known after apply)
              + type_name    = (known after apply)

              + example {
                  + description    = (known after apply)
                  + external_value = (known after apply)
                  + name           = (known after apply)
                  + summary        = (known after apply)
                  + value          = (known after apply)
                }

              + form_parameter {
                  + default_value = (known after apply)
                  + description   = (known after apply)
                  + name          = (known after apply)
                  + required      = (known after apply)
                  + type          = (known after apply)
                  + values        = (known after apply)
                }
            }
        }
    }

  # module.rnl.module.sso_service.module.sso_service.azurerm_api_management_api_policy.api_management_api_policy_api_public will be created
  + resource "azurerm_api_management_api_policy" "api_management_api_policy_api_public" {
      + api_management_name = "rnl-dev"
      + api_name            = "rnl-sso-dev-api-management-api-public"
      + id                  = (known after apply)
      + resource_group_name = "rnl-dev"
      + xml_content         = (known after apply)
    }

  # module.rnl.module.sso_service.module.sso_service.azurerm_app_service_plan.app_service_plan will be created
  + resource "azurerm_app_service_plan" "app_service_plan" {
      + id                           = (known after apply)
      + kind                         = "FunctionApp"
      + location                     = "eastus"
      + maximum_elastic_worker_count = (known after apply)
      + maximum_number_of_workers    = (known after apply)
      + name                         = "rnl-sso-dev"
      + reserved                     = true
      + resource_group_name          = "rnl-dev"

      + sku {
          + capacity = (known after apply)
          + size     = "Y1"
          + tier     = "Dynamic"
        }
    }

  # module.rnl.module.sso_service.module.sso_service.azurerm_application_insights.application_insights will be created
  + resource "azurerm_application_insights" "application_insights" {
      + app_id                                = (known after apply)
      + application_type                      = "Node.JS"
      + connection_string                     = (sensitive value)
      + daily_data_cap_in_gb                  = (known after apply)
      + daily_data_cap_notifications_disabled = (known after apply)
      + disable_ip_masking                    = false
      + force_customer_storage_for_profiler   = false
      + id                                    = (known after apply)
      + instrumentation_key                   = (sensitive value)
      + internet_ingestion_enabled            = true
      + internet_query_enabled                = true
      + local_authentication_disabled         = false
      + location                              = "eastus"
      + name                                  = "rnl-sso-dev"
      + resource_group_name                   = "rnl-dev"
      + retention_in_days                     = 90
      + sampling_percentage                   = 100
    }

  # module.rnl.module.sso_service.module.sso_service.azurerm_function_app.function_app will be created
  + resource "azurerm_function_app" "function_app" {
      + app_service_plan_id             = (known after apply)
      + app_settings                    = (known after apply)
      + client_affinity_enabled         = (known after apply)
      + custom_domain_verification_id   = (known after apply)
      + default_hostname                = (known after apply)
      + enable_builtin_logging          = true
      + enabled                         = true
      + https_only                      = true
      + id                              = (known after apply)
      + key_vault_reference_identity_id = (known after apply)
      + kind                            = (known after apply)
      + location                        = "eastus"
      + name                            = "rnl-sso-dev"
      + os_type                         = "linux"
      + outbound_ip_addresses           = (known after apply)
      + possible_outbound_ip_addresses  = (known after apply)
      + resource_group_name             = "rnl-dev"
      + site_credential                 = (known after apply)
      + storage_account_access_key      = (sensitive value)
      + storage_account_name            = "rnlssodev"
      + storage_connection_string       = (sensitive value)
      + version                         = "~4"

      + auth_settings {
          + default_provider              = "AzureActiveDirectory"
          + enabled                       = true
          + issuer                        = "https://login.microsoftonline.com/681fbbd1-92cd-4528-bce9-a28ccfbdc3bb"
          + token_refresh_extension_hours = 72
          + token_store_enabled           = false
          + unauthenticated_client_action = "RedirectToLoginPage"

          + active_directory {
              + client_id = (known after apply)
            }
        }

      + connection_string {
          + name  = (known after apply)
          + type  = (known after apply)
          + value = (sensitive value)
        }

      + identity {
          + identity_ids = (known after apply)
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = (known after apply)
        }

      + site_config {
          + always_on                        = (known after apply)
          + app_scale_limit                  = (known after apply)
          + auto_swap_slot_name              = (known after apply)
          + dotnet_framework_version         = (known after apply)
          + elastic_instance_minimum         = (known after apply)
          + ftps_state                       = (known after apply)
          + health_check_path                = (known after apply)
          + http2_enabled                    = (known after apply)
          + ip_restriction                   = (known after apply)
          + java_version                     = (known after apply)
          + linux_fx_version                 = (known after apply)
          + min_tls_version                  = (known after apply)
          + pre_warmed_instance_count        = (known after apply)
          + runtime_scale_monitoring_enabled = (known after apply)
          + scm_ip_restriction               = (known after apply)
          + scm_type                         = (known after apply)
          + scm_use_main_ip_restriction      = (known after apply)
          + use_32_bit_worker_process        = (known after apply)
          + vnet_route_all_enabled           = (known after apply)
          + websockets_enabled               = (known after apply)

          + cors {
              + allowed_origins     = (known after apply)
              + support_credentials = (known after apply)
            }
        }

      + source_control {
          + branch             = (known after apply)
          + manual_integration = (known after apply)
          + repo_url           = (known after apply)
          + rollback_enabled   = (known after apply)
          + use_mercurial      = (known after apply)
        }
    }

  # module.rnl.module.sso_service.module.sso_service.azurerm_storage_account.storage_account will be created
  + resource "azurerm_storage_account" "storage_account" {
      + access_tier                       = (known after apply)
      + account_kind                      = "StorageV2"
      + account_replication_type          = "LRS"
      + account_tier                      = "Standard"
      + allow_blob_public_access          = false
      + enable_https_traffic_only         = true
      + id                                = (known after apply)
      + infrastructure_encryption_enabled = false
      + is_hns_enabled                    = false
      + large_file_share_enabled          = (known after apply)
      + location                          = "eastus"
      + min_tls_version                   = "TLS1_2"
      + name                              = "rnlssodev"
      + nfsv3_enabled                     = false
      + primary_access_key                = (sensitive value)
      + primary_blob_connection_string    = (sensitive value)
      + primary_blob_endpoint             = (known after apply)
      + primary_blob_host                 = (known after apply)
      + primary_connection_string         = (sensitive value)
      + primary_dfs_endpoint              = (known after apply)
      + primary_dfs_host                  = (known after apply)
      + primary_file_endpoint             = (known after apply)
      + primary_file_host                 = (known after apply)
      + primary_location                  = (known after apply)
      + primary_queue_endpoint            = (known after apply)
      + primary_queue_host                = (known after apply)
      + primary_table_endpoint            = (known after apply)
      + primary_table_host                = (known after apply)
      + primary_web_endpoint              = (known after apply)
      + primary_web_host                  = (known after apply)
      + queue_encryption_key_type         = "Service"
      + resource_group_name               = "rnl-dev"
      + secondary_access_key              = (sensitive value)
      + secondary_blob_connection_string  = (sensitive value)
      + secondary_blob_endpoint           = (known after apply)
      + secondary_blob_host               = (known after apply)
      + secondary_connection_string       = (sensitive value)
      + secondary_dfs_endpoint            = (known after apply)
      + secondary_dfs_host                = (known after apply)
      + secondary_file_endpoint           = (known after apply)
      + secondary_file_host               = (known after apply)
      + secondary_location                = (known after apply)
      + secondary_queue_endpoint          = (known after apply)
      + secondary_queue_host              = (known after apply)
      + secondary_table_endpoint          = (known after apply)
      + secondary_table_host              = (known after apply)
      + secondary_web_endpoint            = (known after apply)
      + secondary_web_host                = (known after apply)
      + shared_access_key_enabled         = true
      + table_encryption_key_type         = "Service"

      + blob_properties {
          + change_feed_enabled      = (known after apply)
          + default_service_version  = (known after apply)
          + last_access_time_enabled = (known after apply)
          + versioning_enabled       = (known after apply)

          + container_delete_retention_policy {
              + days = (known after apply)
            }

          + cors_rule {
              + allowed_headers    = (known after apply)
              + allowed_methods    = (known after apply)
              + allowed_origins    = (known after apply)
              + exposed_headers    = (known after apply)
              + max_age_in_seconds = (known after apply)
            }

          + delete_retention_policy {
              + days = (known after apply)
            }
        }

      + customer_managed_key {
          + key_vault_key_id          = (known after apply)
          + user_assigned_identity_id = (known after apply)
        }

      + network_rules {
          + bypass                     = (known after apply)
          + default_action             = (known after apply)
          + ip_rules                   = (known after apply)
          + virtual_network_subnet_ids = (known after apply)

          + private_link_access {
              + endpoint_resource_id = (known after apply)
              + endpoint_tenant_id   = (known after apply)
            }
        }

      + queue_properties {

          + hour_metrics {
              + enabled               = true
              + include_apis          = true
              + retention_policy_days = 10
              + version               = "1.0"
            }

          + logging {
              + delete                = true
              + read                  = true
              + retention_policy_days = 10
              + version               = "1.0"
              + write                 = true
            }

          + minute_metrics {
              + enabled               = true
              + include_apis          = true
              + retention_policy_days = 10
              + version               = "1.0"
            }
        }

      + routing {
          + choice                      = (known after apply)
          + publish_internet_endpoints  = (known after apply)
          + publish_microsoft_endpoints = (known after apply)
        }

      + share_properties {
          + cors_rule {
              + allowed_headers    = (known after apply)
              + allowed_methods    = (known after apply)
              + allowed_origins    = (known after apply)
              + exposed_headers    = (known after apply)
              + max_age_in_seconds = (known after apply)
            }

          + retention_policy {
              + days = (known after apply)
            }

          + smb {
              + authentication_types            = (known after apply)
              + channel_encryption_type         = (known after apply)
              + kerberos_ticket_encryption_type = (known after apply)
              + versions                        = (known after apply)
            }
        }
    }

Plan: 11 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @camservo, Action: `pull_request`*